3B/CS343/src/10-Optimization.org
#+title: Optimization
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Optimization
Computer with infinite memory and speed requires no optimizations to use less memory or run faster
(space and time).

With finite resources, optimization is useful/necessary to conserve resources and for good performance.
Most programs not written in optimal order or in minimal form.

General forms of optimizations:
- *reordering*: data and code are reordered to increase performance in certain contexts
- *eliding*: removal of unnecessary data, data accesses, and computation
- *replication*: processors, memory, data, and code are duplicated because of limitations in
  processing and communication speed (speed of light)

Optimized program must be isomorphic to original (same result for fixed input).

Kinds of optimizations are restricted by execution environment.

* Sequential Optimizations
Most programs are sequential, even concurrent programs are:
- large, sections of sequential code per thread connected by
  - small sections of concurrent code where threads interact (protected by synchronization and mutual exclusion --- SME)

Sequential execution presents simple semantics for optimization, where operations occur in program
order (sequentially).

Dependencies result in partial ordering among a set of statements (precedence graph):
- *data dependency*: reordering reads and writes
- *control dependency*: statements cannot be reordered if the earlier line determines if the later
  line is executed

To achieve better performance, compiler/hardware make changes:
1. reorder disjoint (independent) operations (variables have different addresses)
2. elide unnecesary operations (transformation/dead code)
   a. remove immediate change, no loop body, tail recursion, etc
3. execute in parallel if multiple functional units (adders, floating units, pipelines, cache)

Very complex reordering, reducing, and overlapping of operations allowed.

Overlapping implies micro-parallelism, but limited capacity in sequential execution.

* Memory Hierarchy
Memory hierarchy includes registers (on CPU), memory, and possibly cache, where replication
must occur across all layers.

Optimizing data flow along hierarchy defines a computer's speed.

Hardware aggressively optimizes data flow for sequential execution.

Having basic understanding of cache is essential to understanding performance of both sequential
and concurrent programs.

** Cache
Since CPU faster than memory, copy data from memory into registers.
But not many registers, so move highly accessed data within a program from memory to registers
for as long as possible and then back to memory.

Can quickly run out of registers as more data accessed, so must rotate data from memory through
registers dynamically (compiler attempts ot keep highly used variables in regsters).

This does not handle highly accessed data _among_ programs (threads), since each context switch
saves and restores most registers to memory (registers are private and cannot be shared).
Solution is to use hardware cache (automatic registers) to stage data without pushing to memory
and allow sharing of data among programs.

Caching transparently hides latency of accessing main memory.
Cache loads in 64/128/256 bytes, called *cache line*, with addresses multiple of line size.

When cache full, data evicted (remove old cache lines to bring in new based on LRU).
When program ends, addresses are flushed from memory hierarchy.

