3B/CS343/10-Optimization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-08 Sun 14:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Optimization</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Optimization</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org310288c">1. Optimization</a></li>
<li><a href="#org84a3b3d">2. Sequential Optimizations</a></li>
<li><a href="#org230a8d2">3. Memory Hierarchy</a>
<ul>
<li><a href="#org6e84892">3.1. Cache</a></li>
<li><a href="#org39ce7da">3.2. Cache Coherence</a></li>
</ul>
</li>
<li><a href="#org88ac49d">4. Concurrent optimizations</a>
<ul>
<li><a href="#org82837ba">4.1. Disjoint Reordering</a></li>
<li><a href="#org331e9f5">4.2. Eliding</a></li>
<li><a href="#orge32045c">4.3. Replication</a></li>
</ul>
</li>
<li><a href="#orga5e89e9">5. Memory Model</a></li>
<li><a href="#org464f61c">6. Preventing Optimization Problems</a></li>
</ul>
</div>
</div>
<div id="outline-container-org310288c" class="outline-2">
<h2 id="org310288c"><span class="section-number-2">1.</span> Optimization</h2>
<div class="outline-text-2" id="text-1">
<p>
Computer with infinite memory and speed requires no optimizations to use less memory or run faster
(space and time).
</p>

<p>
With finite resources, optimization is useful/necessary to conserve resources and for good performance.
Most programs not written in optimal order or in minimal form.
</p>

<p>
General forms of optimizations:
</p>
<ul class="org-ul">
<li><b>reordering</b>: data and code are reordered to increase performance in certain contexts</li>
<li><b>eliding</b>: removal of unnecessary data, data accesses, and computation</li>
<li><b>replication</b>: processors, memory, data, and code are duplicated because of limitations in
processing and communication speed (speed of light)</li>
</ul>

<p>
Optimized program must be isomorphic to original (same result for fixed input).
</p>

<p>
Kinds of optimizations are restricted by execution environment.
</p>
</div>
</div>
<div id="outline-container-org84a3b3d" class="outline-2">
<h2 id="org84a3b3d"><span class="section-number-2">2.</span> Sequential Optimizations</h2>
<div class="outline-text-2" id="text-2">
<p>
Most programs are sequential, even concurrent programs are:
</p>
<ul class="org-ul">
<li>large, sections of sequential code per thread connected by
<ul class="org-ul">
<li>small sections of concurrent code where threads interact (protected by synchronization and mutual exclusion &#x2014; SME)</li>
</ul></li>
</ul>

<p>
Sequential execution presents simple semantics for optimization, where operations occur in program
order (sequentially).
</p>

<p>
Dependencies result in partial ordering among a set of statements (precedence graph):
</p>
<ul class="org-ul">
<li><b>data dependency</b>: reordering reads and writes</li>
<li><b>control dependency</b>: statements cannot be reordered if the earlier line determines if the later
line is executed</li>
</ul>

<p>
To achieve better performance, compiler/hardware make changes:
</p>
<ol class="org-ol">
<li>reorder disjoint (independent) operations (variables have different addresses)</li>
<li>elide unnecesary operations (transformation/dead code)
<ol class="org-ol">
<li>remove immediate change, no loop body, tail recursion, etc</li>
</ol></li>
<li>execute in parallel if multiple functional units (adders, floating units, pipelines, cache)</li>
</ol>

<p>
Very complex reordering, reducing, and overlapping of operations allowed.
</p>

<p>
Overlapping implies micro-parallelism, but limited capacity in sequential execution.
</p>
</div>
</div>
<div id="outline-container-org230a8d2" class="outline-2">
<h2 id="org230a8d2"><span class="section-number-2">3.</span> Memory Hierarchy</h2>
<div class="outline-text-2" id="text-3">
<p>
Memory hierarchy includes registers (on CPU), memory, and possibly cache, where replication
must occur across all layers.
</p>

<p>
Optimizing data flow along hierarchy defines a computer&rsquo;s speed.
</p>

<p>
Hardware aggressively optimizes data flow for sequential execution.
</p>

<p>
Having basic understanding of cache is essential to understanding performance of both sequential
and concurrent programs.
</p>
</div>
<div id="outline-container-org6e84892" class="outline-3">
<h3 id="org6e84892"><span class="section-number-3">3.1.</span> Cache</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Since CPU faster than memory, copy data from memory into registers.
But not many registers, so move highly accessed data within a program from memory to registers
for as long as possible and then back to memory.
</p>

<p>
Can quickly run out of registers as more data accessed, so must rotate data from memory through
registers dynamically (compiler attempts ot keep highly used variables in regsters).
</p>

<p>
This does not handle highly accessed data <span class="underline">among</span> programs (threads), since each context switch
saves and restores most registers to memory (registers are private and cannot be shared).
Solution is to use hardware cache (automatic registers) to stage data without pushing to memory
and allow sharing of data among programs.
</p>

<p>
Caching transparently hides latency of accessing main memory.
Cache loads in 64/128/256 bytes, called <b>cache line</b>, with addresses multiple of line size.
</p>

<p>
When cache full, data evicted (remove old cache lines to bring in new based on LRU).
When program ends, addresses are flushed from memory hierarchy.
</p>
</div>
</div>
