3B/CS343/10-Optimization.tex
% Created 2024-12-08 Sun 14:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Optimization}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Optimization},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Optimization}
\label{sec:orgcd87bd1}
Computer with infinite memory and speed requires no optimizations to use less memory or run faster
(space and time).

With finite resources, optimization is useful/necessary to conserve resources and for good performance.
Most programs not written in optimal order or in minimal form.

General forms of optimizations:
\begin{itemize}
\item \textbf{reordering}: data and code are reordered to increase performance in certain contexts
\item \textbf{eliding}: removal of unnecessary data, data accesses, and computation
\item \textbf{replication}: processors, memory, data, and code are duplicated because of limitations in
processing and communication speed (speed of light)
\end{itemize}

Optimized program must be isomorphic to original (same result for fixed input).

Kinds of optimizations are restricted by execution environment.
\section{Sequential Optimizations}
\label{sec:org4736795}
Most programs are sequential, even concurrent programs are:
\begin{itemize}
\item large, sections of sequential code per thread connected by
\begin{itemize}
\item small sections of concurrent code where threads interact (protected by synchronization and mutual exclusion --- SME)
\end{itemize}
\end{itemize}

Sequential execution presents simple semantics for optimization, where operations occur in program
order (sequentially).

Dependencies result in partial ordering among a set of statements (precedence graph):
\begin{itemize}
\item \textbf{data dependency}: reordering reads and writes
\item \textbf{control dependency}: statements cannot be reordered if the earlier line determines if the later
line is executed
\end{itemize}

To achieve better performance, compiler/hardware make changes:
\begin{enumerate}
\item reorder disjoint (independent) operations (variables have different addresses)
\item elide unnecesary operations (transformation/dead code)
\begin{enumerate}
\item remove immediate change, no loop body, tail recursion, etc
\end{enumerate}
\item execute in parallel if multiple functional units (adders, floating units, pipelines, cache)
\end{enumerate}

Very complex reordering, reducing, and overlapping of operations allowed.

Overlapping implies micro-parallelism, but limited capacity in sequential execution.
\section{Memory Hierarchy}
\label{sec:org05be5c9}
Memory hierarchy includes registers (on CPU), memory, and possibly cache, where replication
must occur across all layers.

Optimizing data flow along hierarchy defines a computer's speed.

Hardware aggressively optimizes data flow for sequential execution.

Having basic understanding of cache is essential to understanding performance of both sequential
and concurrent programs.
\subsection{Cache}
\label{sec:org6e71138}
Since CPU faster than memory, copy data from memory into registers.
But not many registers, so move highly accessed data within a program from memory to registers
for as long as possible and then back to memory.

Can quickly run out of registers as more data accessed, so must rotate data from memory through
registers dynamically (compiler attempts ot keep highly used variables in regsters).

This does not handle highly accessed data \uline{among} programs (threads), since each context switch
saves and restores most registers to memory (registers are private and cannot be shared).
Solution is to use hardware cache (automatic registers) to stage data without pushing to memory
and allow sharing of data among programs.

Caching transparently hides latency of accessing main memory.
Cache loads in 64/128/256 bytes, called \textbf{cache line}, with addresses multiple of line size.

When cache full, data evicted (remove old cache lines to bring in new based on LRU).
When program ends, addresses are flushed from memory hierarchy.
