3B/CS343/10-Optimization.html
<div id="outline-container-org39ce7da" class="outline-3">
<h3 id="org39ce7da"><span class="section-number-3">3.2.</span> Cache Coherence</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Multi-level caches used, each larger but with diminishing speed and cost.
</p>

<p>
Data reads logically percolate variables from memory up memory hierarchy, making cache copies to registers.
</p>

<p>
Necessary to eagerly move reads up memory hierarchy to take advantage of temporal locality.
</p>

<p>
Data writes from registers to variables logically percolate down memory hierarchy though
cache copies to memory.
</p>

<p>
Advantageous to lazily move writes down memory hierarchy since that way later reads see this.
</p>

<p>
If OS moves program to another process, all caching info is invalid and the program&rsquo;s data
hierarchy reforms.
</p>

<p>
Unlike registers, all cache values are shared across the computer.
Hence, a variable can be replicated in a large number of locations.
</p>

<p>
Without cache coherence for shared variable, there is madness.
With cache coherence for shared variable (snooping or directory-based), variables are updated
everywhere.
</p>

<p>
<b>Cache coherence</b>: hardware protocol ensuring update of duplicate data
</p>

<p>
<b>Cache consistency</b>: addresses when processor sees update (bidirectional synchronization)
</p>

<p>
Prevent flickering and scrambling during simultaneous R/W or W/W with update and acknowledge.
</p>

<p>
<span class="underline">Eager</span> cache-consistency means data changes appear instantaneous by waiting for acknowledge from
all cores (complex/expensive).
</p>

<p>
<span class="underline">Lazy</span> cache-consistency allows reader to see own write before acknowledgment (concurrent programs
read stale data):
</p>
<ul class="org-ul">
<li>writes eventually appear in (largely) same order as written</li>
<li>critical section works as writes to shared variable appear before write to lock release (so
other threads see write to lock after write to shared variable)</li>
<li>otherwise, spin (lock) until write appears</li>
</ul>

<p>
<b>Cache thrashing</b>: if threads continually read/write same memory locations, they invalidate
duplicate cache lines, resulting in excessive cache updates (updated value bounces from one
cache to the next)
</p>

<p>
<b>False sharing</b>: since cache lines contain multiple variables, cache thrashing can occur inadvertently
</p>

<p>
Fix false sharing by separating variables on same line with sufficient storage (padding) to be
in next cache line.
Difficult for dynamically allocated variables as memory allocator positions storage.
</p>
</div>
</div>
</div>
<div id="outline-container-org88ac49d" class="outline-2">
<h2 id="org88ac49d"><span class="section-number-2">4.</span> Concurrent optimizations</h2>
<div class="outline-text-2" id="text-4">
<p>
In sequential execution, <b>strong memory ordering</b>: reading always returns last value written
</p>

<p>
In concurrent execution, <b>weak memory ordering</b>: reading can return previously written value or
value written in future:
</p>
<ul class="org-ul">
<li>happens on multi-processor because of scheduling and buffering</li>
<li>notion of current value becomes blurred for shared variables unless everyone can see values
assigned simultaneously</li>
</ul>

<p>
SME control order and speed of execution, otherwise non-determinism causes random results or failure.
</p>

<p>
Sequential sections accessing private variables can be optimized normally, but not across concurrent
boundaries.
</p>

<p>
Concurrent sections accessing shared variables can be corrupted by sequential optimizations, so restrict
optimizations to ensure correctness.
</p>

<p>
For correctness and performance, identify concurrent code and only restrict its optimization.
How to restrict depends on what sequential assumptions are implicitly applied by hardware and compiler.
</p>
</div>
<div id="outline-container-org82837ba" class="outline-3">
<h3 id="org82837ba"><span class="section-number-3">4.1.</span> Disjoint Reordering</h3>
<div class="outline-text-3" id="text-4-1">
<p>
\(R_{x} \to R_{y}\) allows \(R_{y} \to R_{x}\), so reordering disjoint reads does not cause problems.
</p>

<p>
\(W_{x} \to R_{y}\) allows \(R_{y} \to W_{x}\) can cause problems.
</p>

<p>
\(R_{x} \to W_{y}\) allows \(W_{y} \to R_{x}\) can cause problems.
</p>

<p>
\(W_{x} \to W_{y}\) allows \(W_{y} \to W_{x}\) can cause problems.
</p>

<p>
Compiler uses all these reorderings to break mutual exclusion:
</p>
<ul class="org-ul">
<li>moves lock entry/exit after/before critical section because entry/exit variables not used
in critical section</li>
<li>double-check locking for singleton-pattern can help
<ul class="org-ul">
<li>both checks check for change in storage at different parts of code (inside and outside lock)</li>
</ul></li>
<li>can fail if writes and reads related to malloc are reordered</li>
</ul>
</div>
</div>
<div id="outline-container-org331e9f5" class="outline-3">
<h3 id="org331e9f5"><span class="section-number-3">4.2.</span> Eliding</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For high-level language, compiler decides when/which variables are loaded into registers and for how
long.
</p>

<p>
Elide reads (loads) by copying (replicating) value into a register.
So, variable logically disappears for duration in register (can cause livelock).
</p>

<p>
Elide meaningless sequential code: can cause task to miss signal by not delaying.
</p>
</div>
</div>
