3B/CS343/10-Optimization.tex
\subsection{Cache Coherence}
\label{sec:orgb3d3f58}
Multi-level caches used, each larger but with diminishing speed and cost.

Data reads logically percolate variables from memory up memory hierarchy, making cache copies to registers.

Necessary to eagerly move reads up memory hierarchy to take advantage of temporal locality.

Data writes from registers to variables logically percolate down memory hierarchy though
cache copies to memory.

Advantageous to lazily move writes down memory hierarchy since that way later reads see this.

If OS moves program to another process, all caching info is invalid and the program's data
hierarchy reforms.

Unlike registers, all cache values are shared across the computer.
Hence, a variable can be replicated in a large number of locations.

Without cache coherence for shared variable, there is madness.
With cache coherence for shared variable (snooping or directory-based), variables are updated
everywhere.

\textbf{Cache coherence}: hardware protocol ensuring update of duplicate data

\textbf{Cache consistency}: addresses when processor sees update (bidirectional synchronization)

Prevent flickering and scrambling during simultaneous R/W or W/W with update and acknowledge.

\uline{Eager} cache-consistency means data changes appear instantaneous by waiting for acknowledge from
all cores (complex/expensive).

\uline{Lazy} cache-consistency allows reader to see own write before acknowledgment (concurrent programs
read stale data):
\begin{itemize}
\item writes eventually appear in (largely) same order as written
\item critical section works as writes to shared variable appear before write to lock release (so
other threads see write to lock after write to shared variable)
\item otherwise, spin (lock) until write appears
\end{itemize}

\textbf{Cache thrashing}: if threads continually read/write same memory locations, they invalidate
duplicate cache lines, resulting in excessive cache updates (updated value bounces from one
cache to the next)

\textbf{False sharing}: since cache lines contain multiple variables, cache thrashing can occur inadvertently

Fix false sharing by separating variables on same line with sufficient storage (padding) to be
in next cache line.
Difficult for dynamically allocated variables as memory allocator positions storage.
\section{Concurrent optimizations}
\label{sec:orgb41b982}
In sequential execution, \textbf{strong memory ordering}: reading always returns last value written

In concurrent execution, \textbf{weak memory ordering}: reading can return previously written value or
value written in future:
\begin{itemize}
\item happens on multi-processor because of scheduling and buffering
\item notion of current value becomes blurred for shared variables unless everyone can see values
assigned simultaneously
\end{itemize}

SME control order and speed of execution, otherwise non-determinism causes random results or failure.

Sequential sections accessing private variables can be optimized normally, but not across concurrent
boundaries.

Concurrent sections accessing shared variables can be corrupted by sequential optimizations, so restrict
optimizations to ensure correctness.

For correctness and performance, identify concurrent code and only restrict its optimization.
How to restrict depends on what sequential assumptions are implicitly applied by hardware and compiler.
\subsection{Disjoint Reordering}
\label{sec:orgfb0fda4}
\(R_{x} \to R_{y}\) allows \(R_{y} \to R_{x}\), so reordering disjoint reads does not cause problems.

\(W_{x} \to R_{y}\) allows \(R_{y} \to W_{x}\) can cause problems.

\(R_{x} \to W_{y}\) allows \(W_{y} \to R_{x}\) can cause problems.

\(W_{x} \to W_{y}\) allows \(W_{y} \to W_{x}\) can cause problems.

Compiler uses all these reorderings to break mutual exclusion:
\begin{itemize}
\item moves lock entry/exit after/before critical section because entry/exit variables not used
in critical section
\item double-check locking for singleton-pattern can help
\begin{itemize}
\item both checks check for change in storage at different parts of code (inside and outside lock)
\end{itemize}
\item can fail if writes and reads related to malloc are reordered
\end{itemize}
\subsection{Eliding}
\label{sec:org911c0c0}
For high-level language, compiler decides when/which variables are loaded into registers and for how
long.

Elide reads (loads) by copying (replicating) value into a register.
So, variable logically disappears for duration in register (can cause livelock).

Elide meaningless sequential code: can cause task to miss signal by not delaying.
