3B/CS343/src/10-Optimization.org
** Replication
Benefit to reorder R/W since faster instructions can then happen at once.

Modern processors increase performance by executing multiple instructions in parallel (data flow,
precedence graph) on replicated hardware:
- internal pool of instructions taken from program order
- begin simultaneous execution of instructions with inputs
- collect results from finished instructions
- feed results back into instruction pool as inputs
- so, instructions with independent inputs execute out-of-order

From sequential perspective, disjoint reordering is unimportant, so hardware starts many instructions
simultaneously.

From concurrent perspective, disjoint reordering is important.

* Memory Model
Manufacturers define set of optimizations performed implicitly by processor.

*Memory model* is defined by set of optimizations.

Atomic consistent (AT) has events occur instantaneously, so slow or impossible to optimize.

Sequential consistency (SC) accepts all events cannot occur instantaneously, so may read old values.
Still strong enough for software mutual exclusion (often considered minimum model for concurrency).

No hardware supports just AT/SC.

* Preventing Optimization Problems
All optimization problems result from races on shared variables.

If shared data is protected by locks (implicit or explicit):
- locks define sequential/concurrent boundaries
- boundaries must preclude optimizations that affect concurrency

*Race free*: synchronization and mutual exclusion preclude races

Race free does have races, since races are internal to locks, which lock programmer must deal with.

Two approaches:
- _ad hoc_: programmer manually augments all data races with pragmas to restrict compiler/hardware
  optimizations (not portable but often optimal)
- _formal_: language has memory model and mechanisms to abstractly define races in program
  (portable but often baroque and suboptimal)

Data access/compiler: ~volatile~ qualifier
- force variable loads and stores to/from registers (at sequence points)
- created for ~longjmp~ or force access for memory-mapped devices
- for architectures with few registers, all variables are pretty much implicitly volatile
- Java ~volatile~ and C++11 ~atomic~ are stronger, since they prevent eliding and disjoint reordering
  - C++11 ~atomic~ automatically fences shared variables, but can be suboptimal


Program order/compiler (static): disable inlining or use ~asm("" ::: "memory");~

Memory order/runtime (dynamic): ~sfence~, ~lfence~, ~mfence~, which guarantee previous stores
and/or leads are completed before continuing.

Atomic operations test-and-set often imply fencing.

Cache is normally invisible and does not cause issues (except for dynamic memory allocation).

Mechanisms to fix issues are specific to compiler or platform: difficult, low-level, diverse semantics,
and not portable.

Locks built with these features ensure SC for protected shared variables: no user races and strong
locks, so SC memory model.
