3B/CS343/10-Optimization.html
<div id="outline-container-orge32045c" class="outline-3">
<h3 id="orge32045c"><span class="section-number-3">4.3.</span> Replication</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Benefit to reorder R/W since faster instructions can then happen at once.
</p>

<p>
Modern processors increase performance by executing multiple instructions in parallel (data flow,
precedence graph) on replicated hardware:
</p>
<ul class="org-ul">
<li>internal pool of instructions taken from program order</li>
<li>begin simultaneous execution of instructions with inputs</li>
<li>collect results from finished instructions</li>
<li>feed results back into instruction pool as inputs</li>
<li>so, instructions with independent inputs execute out-of-order</li>
</ul>

<p>
From sequential perspective, disjoint reordering is unimportant, so hardware starts many instructions
simultaneously.
</p>

<p>
From concurrent perspective, disjoint reordering is important.
</p>
</div>
</div>
</div>
<div id="outline-container-orga5e89e9" class="outline-2">
<h2 id="orga5e89e9"><span class="section-number-2">5.</span> Memory Model</h2>
<div class="outline-text-2" id="text-5">
<p>
Manufacturers define set of optimizations performed implicitly by processor.
</p>

<p>
<b>Memory model</b> is defined by set of optimizations.
</p>

<p>
Atomic consistent (AT) has events occur instantaneously, so slow or impossible to optimize.
</p>

<p>
Sequential consistency (SC) accepts all events cannot occur instantaneously, so may read old values.
Still strong enough for software mutual exclusion (often considered minimum model for concurrency).
</p>

<p>
No hardware supports just AT/SC.
</p>
</div>
</div>
<div id="outline-container-org464f61c" class="outline-2">
<h2 id="org464f61c"><span class="section-number-2">6.</span> Preventing Optimization Problems</h2>
<div class="outline-text-2" id="text-6">
<p>
All optimization problems result from races on shared variables.
</p>

<p>
If shared data is protected by locks (implicit or explicit):
</p>
<ul class="org-ul">
<li>locks define sequential/concurrent boundaries</li>
<li>boundaries must preclude optimizations that affect concurrency</li>
</ul>

<p>
<b>Race free</b>: synchronization and mutual exclusion preclude races
</p>

<p>
Race free does have races, since races are internal to locks, which lock programmer must deal with.
</p>

<p>
Two approaches:
</p>
<ul class="org-ul">
<li><span class="underline">ad hoc</span>: programmer manually augments all data races with pragmas to restrict compiler/hardware
optimizations (not portable but often optimal)</li>
<li><span class="underline">formal</span>: language has memory model and mechanisms to abstractly define races in program
(portable but often baroque and suboptimal)</li>
</ul>

<p>
Data access/compiler: <code>volatile</code> qualifier
</p>
<ul class="org-ul">
<li>force variable loads and stores to/from registers (at sequence points)</li>
<li>created for <code>longjmp</code> or force access for memory-mapped devices</li>
<li>for architectures with few registers, all variables are pretty much implicitly volatile</li>
<li>Java <code>volatile</code> and C++11 <code>atomic</code> are stronger, since they prevent eliding and disjoint reordering
<ul class="org-ul">
<li>C++11 <code>atomic</code> automatically fences shared variables, but can be suboptimal</li>
</ul></li>
</ul>


<p>
Program order/compiler (static): disable inlining or use <code>asm("" ::: "memory");</code>
</p>

<p>
Memory order/runtime (dynamic): <code>sfence</code>, <code>lfence</code>, <code>mfence</code>, which guarantee previous stores
and/or leads are completed before continuing.
</p>

<p>
Atomic operations test-and-set often imply fencing.
</p>

<p>
Cache is normally invisible and does not cause issues (except for dynamic memory allocation).
</p>

<p>
Mechanisms to fix issues are specific to compiler or platform: difficult, low-level, diverse semantics,
and not portable.
</p>

<p>
Locks built with these features ensure SC for protected shared variables: no user races and strong
locks, so SC memory model.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-08 Sun 14:49</p>
</div>
</body>
</html>
