3B/CS343/10-Optimization.tex
\subsection{Replication}
\label{sec:org6774570}
Benefit to reorder R/W since faster instructions can then happen at once.

Modern processors increase performance by executing multiple instructions in parallel (data flow,
precedence graph) on replicated hardware:
\begin{itemize}
\item internal pool of instructions taken from program order
\item begin simultaneous execution of instructions with inputs
\item collect results from finished instructions
\item feed results back into instruction pool as inputs
\item so, instructions with independent inputs execute out-of-order
\end{itemize}

From sequential perspective, disjoint reordering is unimportant, so hardware starts many instructions
simultaneously.

From concurrent perspective, disjoint reordering is important.
\section{Memory Model}
\label{sec:org2a0b9ff}
Manufacturers define set of optimizations performed implicitly by processor.

\textbf{Memory model} is defined by set of optimizations.

Atomic consistent (AT) has events occur instantaneously, so slow or impossible to optimize.

Sequential consistency (SC) accepts all events cannot occur instantaneously, so may read old values.
Still strong enough for software mutual exclusion (often considered minimum model for concurrency).

No hardware supports just AT/SC.
\section{Preventing Optimization Problems}
\label{sec:org34a2679}
All optimization problems result from races on shared variables.

If shared data is protected by locks (implicit or explicit):
\begin{itemize}
\item locks define sequential/concurrent boundaries
\item boundaries must preclude optimizations that affect concurrency
\end{itemize}

\textbf{Race free}: synchronization and mutual exclusion preclude races

Race free does have races, since races are internal to locks, which lock programmer must deal with.

Two approaches:
\begin{itemize}
\item \uline{ad hoc}: programmer manually augments all data races with pragmas to restrict compiler/hardware
optimizations (not portable but often optimal)
\item \uline{formal}: language has memory model and mechanisms to abstractly define races in program
(portable but often baroque and suboptimal)
\end{itemize}

Data access/compiler: \texttt{volatile} qualifier
\begin{itemize}
\item force variable loads and stores to/from registers (at sequence points)
\item created for \texttt{longjmp} or force access for memory-mapped devices
\item for architectures with few registers, all variables are pretty much implicitly volatile
\item Java \texttt{volatile} and C++11 \texttt{atomic} are stronger, since they prevent eliding and disjoint reordering
\begin{itemize}
\item C++11 \texttt{atomic} automatically fences shared variables, but can be suboptimal
\end{itemize}
\end{itemize}


Program order/compiler (static): disable inlining or use \texttt{asm("" ::: "memory");}

Memory order/runtime (dynamic): \texttt{sfence}, \texttt{lfence}, \texttt{mfence}, which guarantee previous stores
and/or leads are completed before continuing.

Atomic operations test-and-set often imply fencing.

Cache is normally invisible and does not cause issues (except for dynamic memory allocation).

Mechanisms to fix issues are specific to compiler or platform: difficult, low-level, diverse semantics,
and not portable.

Locks built with these features ensure SC for protected shared variables: no user races and strong
locks, so SC memory model.
\end{document}
